{
 "module": "keras",
 "class_name": "Sequential",
 "config": {
  "name": "sequential_43",
  "trainable": true,
  "dtype": {
   "module": "keras",
   "class_name": "DTypePolicy",
   "config": {
    "name": "float32"
   },
   "registered_name": null
  },
  "layers": [
   {
    "module": "keras.layers",
    "class_name": "InputLayer",
    "config": {
     "batch_shape": [
      null,
      24,
      11
     ],
     "dtype": "float32",
     "sparse": false,
     "name": "input_layer_43"
    },
    "registered_name": null
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_177",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": true,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 256,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 38
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 39
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.05
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.0,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      11
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_149",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "axis": -1,
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "gamma_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "moving_mean_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "moving_variance_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null,
     "synchronized": false
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      256
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "Dropout",
    "config": {
     "name": "dropout_80",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "rate": 0.1,
     "seed": null,
     "noise_shape": null
    },
    "registered_name": null
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_178",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": true,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 128,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 40
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 41
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.04
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.0,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      256
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_150",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "axis": -1,
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "gamma_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "moving_mean_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "moving_variance_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null,
     "synchronized": false
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      128
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "Dropout",
    "config": {
     "name": "dropout_81",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "rate": 0.1,
     "seed": null,
     "noise_shape": null
    },
    "registered_name": null
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_179",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": true,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 64,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 42
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 43
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.03
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.0,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      128
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_180",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": true,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 32,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 44
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 45
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.03
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.0,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      64
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_181",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": false,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 16,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 46
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 47
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.01
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.0,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      32
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_151",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "axis": -1,
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "gamma_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "moving_mean_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "moving_variance_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null,
     "synchronized": false
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      16
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "Dense",
    "config": {
     "name": "dense_43",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "units": 24,
     "activation": "linear",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": 48
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      16
     ]
    }
   }
  ],
  "build_input_shape": [
   null,
   24,
   11
  ]
 },
 "registered_name": null,
 "build_config": {
  "input_shape": [
   null,
   24,
   11
  ]
 },
 "compile_config": {
  "optimizer": {
   "module": "keras.optimizers",
   "class_name": "Adam",
   "config": {
    "name": "adam",
    "learning_rate": {
     "module": "keras.optimizers.schedules",
     "class_name": "ExponentialDecay",
     "config": {
      "initial_learning_rate": 0.0005,
      "decay_steps": 10000,
      "decay_rate": 0.96,
      "staircase": true,
      "name": "ExponentialDecay"
     },
     "registered_name": null
    },
    "weight_decay": null,
    "clipnorm": null,
    "global_clipnorm": null,
    "clipvalue": null,
    "use_ema": false,
    "ema_momentum": 0.99,
    "ema_overwrite_frequency": null,
    "loss_scale_factor": null,
    "gradient_accumulation_steps": null,
    "beta_1": 0.9,
    "beta_2": 0.999,
    "epsilon": 1e-07,
    "amsgrad": false
   },
   "registered_name": null
  },
  "loss": "mean_squared_error",
  "loss_weights": null,
  "metrics": [
   "mean_absolute_error",
   {
    "module": "builtins",
    "class_name": "function",
    "config": "mean_error",
    "registered_name": "function"
   },
   {
    "module": "builtins",
    "class_name": "function",
    "config": "r2_score",
    "registered_name": "function"
   }
  ],
  "weighted_metrics": null,
  "run_eagerly": false,
  "steps_per_execution": 1,
  "jit_compile": false
 }
}